app/controllers/task_items_controller.rb

  def show
    @task_item = TaskItem.find(params[:id])
---
SELECT "task_items".* FROM "task_items" WHERE "task_items"."id" = 4 LIMIT 1

  def edit
    @task_item = TaskItem.find(params[:id])
---
SELECT "task_items".* FROM "task_items" WHERE "task_items"."id" = 5 LIMIT 1

  def create
    @task_item = TaskItem.new(params[:task_item])

    respond_to do |format|
      if @task_item.save
---
INSERT INTO "task_items" ("total_hours_of_work", "start_date", "status", "summary", "title", "end_date", "user_id", "priority", "created_at", "updated_at") VALUES (75, '2011-03-01', '12%', 'Yeah! tell me anything that you want me to do. really? No! right now I don''t have anything for you. So come tomorrow!. What do you think that I am free for you always. Yeah I believe that it is. Okay then I am not coming tomorrow do whatever u want to do. Its totally your wish. Okay Gud bbye. Hey wait wait I was just kidding. Please take this. and do your work. bbye.', 'The very new task by Vinay.', '2011-04-01', 2, 'medium', '2011-03-05 10:00:04.797105', '2011-03-05 10:00:04.797105')

  def update
    @task_item = TaskItem.find(params[:id])

    respond_to do |format|
      if @task_item.update_attributes(params[:task_item])
---
SELECT "task_items".* FROM "task_items" WHERE "task_items"."id" = 5 LIMIT 1
UPDATE "task_items" SET "status" = '12', "updated_at" = '2011-03-05 10:07:37.149049' WHERE "task_items"."id" = 5